[
    {
        "id": 1,
        "name": "Max Motor",
        "title": "This Is an Electric Parts Manufacturer Company Website",
        "description": "Logged in users & admins have different access. Protected Route for buy now button. So users need to log in before placing an order.Normal users will be able to place & see their orders, add reviews, and add/update info on their profile page. Admin can manage all orders made by normal users, add new products, make new admins, and manage all products.",
        "image": "https://i.ibb.co/37bTm8y/1.jpg",
        "site": "https://manufacturer-website-af272.web.app/",
        "client": "https://github.com/sayedpritom999/Manufacturer-website-client",
        "server": "https://github.com/sayedpritom999/manufacturer-website-server"
    },
    {
        "id": 2,
        "name": "Ware House",
        "title": "Shoe Company warehouse management website",
        "description": "Email/password-based login/authentication and social login(Google, GitHub). Protected Route for update button. So users need to log in before updating any item. Logged-in users can delete an item, add items & update any item’s stock. Implemented the basic version of the JWT for email/password-based authentication.",
        "image": "https://i.ibb.co/1mgfLmT/2.jpg",
        "site": "https://warehouse-eebb3.web.app/",
        "client": "https://github.com/sayedpritom999/Manufacturer-website-client",
        "server": "https://github.com/sayedpritom999/manufacturer-website-server"
    },
    {
        "id": 3,
        "name": "Honda - Lucky Picker",
        "title": "Honda – Random Car Picker Website",
        "description": "Add to cart functionality Based on selected items, clicking on the button  “choose one for me”  shows a random item and overall responsive Layout",
        "description": "Add to cart functionality Based on selected items, clicking on the button  “choose one for me”  shows a random item and overall responsive Layout",
        "image": "https://i.ibb.co/86gkqj4/3.jpg",
        "site": "https://earnest-chebakia-16168d.netlify.app/",
        "client": "https://github.com/sayedpritom999/lucky-one-Random-Item-Picker-"
    },
    {
        "id": 4,
        "name": "Savings Calculator",
        "title": "A Basic calculator for tracking income, expenses, savings, and current balance.",
        "description": "This is a basic calculator for tracking income, expenses, savings, and current balance. The user needs to input a list of expenses (food, rent, cloth), and pressing the calculate button shows the total expenses and balance. Then it's time to input the percentage of saving of the whole income he wants to do. Once clicked on the save button it will show how much money he has left in the current/remaining balance and in the total saving amount. ",
        "image": "https://i.ibb.co/LhMFgBq/4.jpg",
        "site": "https://distracted-hodgkin-8b450c.netlify.app/",
        "client": "https://github.com/sayedpritom999/money-master"
    },
    {
        "id": 5,
        "name": "GMB-Akash",
        "title": "This Is GMB Akash's Photography Portfolio Website",
        "description": "Website features, functionalities & specs: Dynamic Carousel, Photo collage made with bootstrap grid system, React Dynamic Routing, Service section showing Services, Implemented private/protected route, Private route redirects to login page if user is not logged in, After login user is redirected to the previous route that he/she was going, After login, reloading the page will not redirect user to login page again, Implemented Email & Password Authentication using react firebase hooks, Implemented 2 extra login options, Implemented conditional logout button on the header, Implemented blog & about me & 404 Routes",
        "image": "https://i.ibb.co/31YcBQR/5.jpg",
        "site": "https://gmb-akash.web.app/",
        "client": "https://github.com/sayedpritom999/GMB-Akash-Portfolio"
    }
]